
&НаКлиенте
Процедура ДвиженияОсновнойРегистрБухгалтерииВалютаДтПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ДвиженияОсновнойРегистрБухгалтерии.ТекущиеДанные;
   	ДанныеТекущейСтроки.Сумма = Бухгалтерия.РассчитатьЭквивалент(ДанныеТекущейСтроки.ВалютнаяСуммаДт, 
								ДанныеТекущейСтроки.ВалютаДт, Объект.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ДвиженияОсновнойРегистрБухгалтерииВалютаКтПриИзменении(Элемент)
		
	ДанныеТекущейСтроки = Элементы.ДвиженияОсновнойРегистрБухгалтерии.ТекущиеДанные;
   	//Если НЕ ДанныеТекущейСтроки.СчетДт.Валютный Тогда
		ДанныеТекущейСтроки.Сумма = Бухгалтерия.РассчитатьЭквивалент(ДанныеТекущейСтроки.ВалютнаяСуммаКт, 
									ДанныеТекущейСтроки.ВалютаКт, Объект.Дата);		
	//КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ВключитьВыключитьПроводки(Команда)
	
	ПереключитьАктивностьПроводок();
	
КонецПроцедуры

&НаСервере
Процедура ПереключитьАктивностьПроводок()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Проводки = Документ.Движения.ОсновнойРегистрБухгалтерии;
	КоличествоПроводок = Проводки.Количество();
	
	Если КоличествоПроводок > 0 Тогда
		Проводки.УстановитьАктивность(НЕ Проводки[0].Активность);	
	КонецЕсли; 

	ЗначениеВРеквизитФормы(Документ, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ДвиженияОсновнойРегистрБухгалтерииВалютнаяСуммаДтПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ДвиженияОсновнойРегистрБухгалтерии.ТекущиеДанные;
   	ДанныеТекущейСтроки.Сумма = Бухгалтерия.РассчитатьЭквивалент(ДанныеТекущейСтроки.ВалютнаяСуммаДт, 
								ДанныеТекущейСтроки.ВалютаДт, Объект.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ДвиженияОсновнойРегистрБухгалтерииВалютнаяСуммаКтПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ДвиженияОсновнойРегистрБухгалтерии.ТекущиеДанные;
   	//Если НЕ ДанныеТекущейСтроки.СчетДт.Валютный Тогда
		ДанныеТекущейСтроки.Сумма = Бухгалтерия.РассчитатьЭквивалент(ДанныеТекущейСтроки.ВалютнаяСуммаКт, 
									ДанныеТекущейСтроки.ВалютаКт, Объект.Дата);		
	//КонецЕсли;	
	
КонецПроцедуры
