&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьСубконто();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСубконто()
	
	Для НомерСубконто = 1 по 2 Цикл

		Если (НомерСубконто <= Объект.Счет.ВидыСубконто.Количество()) и (НЕ Объект.Счет.Пустая()) Тогда
			Элементы["Субконто"+НомерСубконто].Заголовок = Строка(Объект.Счет.ВидыСубконто[НомерСубконто-1].ВидСубконто);
			Элементы["Субконто"+НомерСубконто].Видимость = Истина;
		Иначе
			Элементы["Субконто"+НомерСубконто].Видимость = Ложь;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	ВыбиратьТипСубконто();
	
	УстановитьВидимостьСубконто();
	
КонецПроцедуры

&НаСервере
Процедура ВыбиратьТипСубконто()
	
	ЧислоСубконто = Объект.Счет.ВидыСубконто.Количество();
	
	Для Сч = 1 По ЧислоСубконто Цикл
		ТипСубконто = Объект.Счет.ВидыСубконто[Сч - 1].ВидСубконто.ТипЗначения;
		Элементы["Субконто" + Сч].ВыбиратьТип = 
									(ТипСубконто.Типы().Количество() > 1);
		
		Если ТипСубконто.ПривестиЗначение(Объект["Субконто" + Сч]) 
									<> Объект["Субконто" + Сч] Тогда
			Объект["Субконто" + Сч] = 
			ТипСубконто.ПривестиЗначение(Объект["Субконто" + Сч]);
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры
	