
&НаКлиенте
Процедура НеПравильно(Команда)
	
	ПолучитьОстатокПоСчету(Остаток);
	
КонецПроцедуры

&НаКлиенте
Процедура Правильно(Команда)
	
	ПолучитьОстатокПоСчету2(Остаток);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьОстатокПоСчету(Остаток)
	
	Остаток = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Остатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.ОсновнойРегистрБухгалтерии.Остатки(, Счет.Код = ""1.1"",	, ) КАК Остатки";
	
	Остатки = Запрос.Выполнить().Выбрать();
	Остатки.Следующий();
	Остаток = Остатки.СуммаОстаток;	

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьОстатокПоСчету2(Остаток)
	
	Остаток = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Остатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.ОсновнойРегистрБухгалтерии.Остатки(, Счет = &Счет, , ) КАК Остатки";
	
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.ОсновнойПланСчетов.Касса);

	Остатки = Запрос.Выполнить().Выбрать();
	Остатки.Следующий();
	Остаток = Остатки.СуммаОстаток;	

КонецПроцедуры

&НаКлиенте
Процедура СвойстваСубконтоСчета(Команда)

	ВывестиСвойстваВидаСубконто(Счет);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиСвойстваВидаСубконто(Счет)
	
	Сообщение = Новый СообщениеПользователю();
	
	Для Каждого ВидСубконто Из Счет.ВидыСубконто Цикл
		
		Вид = ВидСубконто.ВидСубконто;
	
		ТипЗначения = Вид.ТипЗначения;
		Наименование = Вид.Наименование; 
			
		ВведенВКонфигураторе = ВидСубконто.Предопределенное;
		Оборотный = ВидСубконто.ТолькоОбороты;
		Количественный = ВидСубконто.Количественный;
		Суммовой = ВидСубконто.Суммовой;

		Сообщение.Текст = "Вид субконто: " + Наименование + ", Предопределенное - " + Строка(ВведенВКонфигураторе) + 
						", Оборотный - " + Строка(Оборотный) + ", Количественный - " + Строка(Количественный) +
						", Суммовой - " + Строка(Суммовой);
		Сообщение.Сообщить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСвойстваСубконтоСчета(Команда)
	
	ЗаполнитьСвойстваСубконтоНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСвойстваСубконтоНаСервере()
	
	Счет = ПланыСчетов.ОсновнойПланСчетов.Касса;
	ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Сотрудники;
	
	Если Счет.ВидыСубконто.Найти(ВидСубконто,"ВидСубконто")= Неопределено Тогда
		
		СчетОбъект = Счет.ПолучитьОбъект();
	
		НовыйВид = СчетОбъект.ВидыСубконто.Добавить();
		НовыйВид.ВидСубконто = ВидСубконто;
		НовыйВид.Суммовой = Истина;
		НовыйВид.Количественный = Истина;
		
		СчетОбъект.Записать();
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписьДвиженийБезПроведенияДокумента(Команда)
	
	ЗаписьДвиженийБезПроведенияНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписьДвиженийБезПроведенияНаСервере()
	
	Приходные = Документы.ПриходнаяНакладная.Выбрать();
	
	Пока Приходные.Следующий() Цикл
		ПриходнаяОбъект = Приходные.ПолучитьОбъект();
		Проводки = ПриходнаяОбъект.Движения.ОсновнойРегистрБухгалтерии;

		НоваяПроводка = Проводки.Добавить();
		НоваяПроводка.Период = ПриходнаяОбъект.Дата;
		НоваяПроводка.Организация = ПриходнаяОбъект.Организация;
		НоваяПроводка.СчетДт = ПланыСчетов.ОсновнойПланСчетов.Товары;
		НоваяПроводка.СчетКт = ПланыСчетов.ОсновнойПланСчетов.Поставщики;
		НоваяПроводка.Сумма = ПриходнаяОбъект.Всего;

		Проводки.Записать(Ложь);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьДвиженийСПомощьюНабораЗаписей(Команда)
	
	ЗаписьДвиженийСПомощьюНабораЗаписейНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписьДвиженийСПомощьюНабораЗаписейНаСервере()
	
	Приходные = Документы.ПриходнаяНакладная.Выбрать();
	
	Проводки = РегистрыБухгалтерии.ОсновнойРегистрБухгалтерии.СоздатьНаборЗаписей();
	
	Пока Приходные.Следующий() Цикл
		ПриходнаяСсылка = Приходные.Ссылка;
		Проводки.Отбор.Регистратор.Установить(ПриходнаяСсылка);

		НоваяПроводка = Проводки.Добавить();
		НоваяПроводка.Период = ПриходнаяСсылка.Дата;
		НоваяПроводка.Организация = ПриходнаяСсылка.Организация;
		НоваяПроводка.СчетДт = ПланыСчетов.ОсновнойПланСчетов.Товары;
		НоваяПроводка.СчетКт = ПланыСчетов.ОсновнойПланСчетов.Поставщики;
		НоваяПроводка.Сумма  = ПриходнаяСсылка.Всего;

		Проводки.Записать(Ложь);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоВалютнымСчетам(Команда)
	
	ПолучитьОстаткиПоВалютнымСчетам();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьОстаткиПоВалютнымСчетам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|		Остатки.Счет,
	|		Остатки.Валюта,
	|		Остатки.ВалютнаяСуммаОстаток,
	|		Остатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.ОсновнойРегистрБухгалтерии.Остатки(, Счет.Валютный = ИСТИНА, , ) КАК Остатки";
	
	Результат = Запрос.Выполнить();
   	Остатки = Результат.Выбрать();
	
	ТЗ.Очистить();
	Пока Остатки.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Счет = Остатки.Счет;
		НоваяСтрока.Валюта = Остатки.Валюта;
		НоваяСтрока.ВалютнаяСуммаОстаток = Остатки.ВалютнаяСуммаОстаток;
		НоваяСтрока.СуммаОстаток = Остатки.СуммаОстаток;
	КонецЦикла;

КонецПроцедуры
